<?php

/**
 * 自动组建的config 题型
 */

$array = array();
//=======会计从业-会计基础===========
$array[401] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'20',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'20',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'20',
    ),
    3=>array(
        'id' => 101005,
        'alias' =>'',
        'num' =>'2',
    ),
);

//=======会计从业-财政法规与会计职业道德===========
$array[402] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'20',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'20',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'20',
    ),
    3=>array(
        'id' => 101007,
        'alias' =>'',
        'num' =>'2',
    ),
);


//=======会计从业-初级会计电算化===========
$array[403] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'20',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'20',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'20',
    ),
    3=>array(
        'id' => 101008,
        'alias' =>'',
        'num' =>'2',
    ),
);


//=======初级会计-初级会计实务===========
$array[412] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'20',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'20',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'20',
    ),
    3=>array(
        'id' => 101003,
        'alias' =>'',
        'num' =>'3',
    ),
);

//=======初级会计-经济法基础===========
$array[413] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'20',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'20',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'20',
    ),
    3=>array(
        'id' => 101003,
        'alias' =>'',
        'num' =>'3',
    ),
);


//=======中级会计-经济法===========
$array[414] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'30',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'15',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'10',
    ),
    3=>array(
        'id' => 101006,
        'alias' =>'',
        'num' =>'3',
    ),
    4=>array(
        'id' => 101009,
        'alias' =>'',
        'num' =>'1',
    ),
);


//=======中级会计-中级会计实务===========
$array[415] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'15',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'10',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'10',
    ),
    3=>array(
        'id' => 101010,
        'alias' =>'',
        'num' =>'2',
    ),
    4=>array(
        'id' => 101009,
        'alias' =>'',
        'num' =>'2',
    ),
);


//=======中级会计-财务管理===========
$array[416] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'25',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'10',
    ),
    2=>array(
        'id' => 101004,
        'alias' =>'',
        'num' =>'10',
    ),
    3=>array(
        'id' => 101005,
        'alias' =>'',
        'num' =>'4',
    ),
    4=>array(
        'id' => 101009,
        'alias' =>'',
        'num' =>'2',
    ),
);


//========cpa-会计====================
$array[420] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'16',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'10',
    ),
    2=>array(
        'id' => 101009,
        'alias' =>'',
        'num' =>'4',
    ),

);



//========cpa-审计================
$array[421] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'25',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'10',
    ),
    2=>array(
        'id' => 101006,
        'alias' =>'',
        'num' =>'6',
    ),
	3=>array(
		'id' => 101009,
		'alias' =>'',
		'num' =>'1',
	),

);


//========cpa-税法================
$array[422] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'24',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'14',
    ),
    2=>array(
        'id' => 101010,
        'alias' =>'',
        'num' =>'4',
    ),
	3=>array(
		'id' => 101011,
		'alias' =>'',
		'num' =>'2',
	),

);



//========cpa-经济法====================
$array[423] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'20',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'12',
    ),
    2=>array(
        'id' => 101011,
        'alias' =>'',
        'num' =>'6',
    ),

);

//========cpa-财务成本管理====================
$array[424] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'25',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'10',
    ),
    2=>array(
        'id' => 101005,
        'alias' =>'',
        'num' =>'5',
    ),
	3=>array(
		'id' => 101009,
		'alias' =>'',
		'num' =>'1',
	),

);

//========cpa-战略与风险管理====================
$array[425] = array(
    0=>array(
        'id' => 101001,
        'alias' =>'',
        'num' =>'25',
    ),
    1=>array(
        'id' => 101002,
        'alias' =>'',
        'num' =>'10',
    ),
    2=>array(
        'id' => 101005,
        'alias' =>'',
        'num' =>'5',
    ),
	3=>array(
		'id' => 101009,
		'alias' =>'',
		'num' =>'1',
	),

);


/**
 * 自动组建的config 题型
 */

$knowledge = array(401=>'110490',402=>'110491',403=>'110492',412=>'110498',413=>'110499',414=>'110495',415=>'110500',416=>'110496',420=>'110497',421=>'110507',422=>'110508',423=>'110505',424=>'110501',425=>'110502');


$examtimes = array(401=>'60',402=>'60',403=>'60',412=>'105',413=>'105',414=>'150',415=>'180',416=>'150',420=>'180',421=>'150',422=>'120',423=>'120',424=>'150',425=>'120');

$url_cp = array('jc'=>401,'fg'=>402,'ds'=>403,'kj'=>412,'jjf'=>413,'zjkj'=>415,'zjjjf'=>414,'zjcw'=>416,'cpakj'=>420,'cpasj'=>421,'cpasf'=>422,'cpajjf'=>423,'cpazl'=>425,'cpacw'=>424);


$t_k = array(
    401 => array(
        't' => '会计基础试题及答案',
        'k' => '会计基础|会计基础试题|会计基础试题及答案|会计基础练习题|会计基础习题|会计基础考试试题|会计基础考试题库|会计基础模拟试题|会计基础考试题',
        'title' => '会计从业资格考试题库_会计基础_会计基础考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,会计基础，会计从业在线模拟考试，会计基础试题,会计基础试题及答案,会计基础考试模拟题,会计基础考试试题,会计基础历年真题',
        'description' => '会计从业会计基础考试题库是一个提供：会计基础专项练习，会计基础每日一练，会计基础考试模拟试题，会计基础考试历年真题，会计基础模拟考试系统，会计基础无纸化考试答题的会计基础试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    402 => array(
        't' => '财经法规与会计职业道德试题及答案',
        'k' => '财经法规与会计职业道德|财经法规与会计职业道德试题及答案|财经法规与会计职业道德试题|财经法规试题|财经法规案例分析题|财经法规试题与答案',
        'title' => '会计从业资格考试题库_财经法规与职业道德_财经法规考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,财经法规与会计职业道德，财经法规与会计职业道德试题，财经法规与会计职业道德试题及答案，财经法规试题，财经法规案例分析题，财经法规模拟题，财经法规历年真题',
        'description' => '会计从业财经法规考试题库是一个提供：财经法规专项练习，财经法规每日一练，财经法规考试模拟试题，财经法规考试历年真题，模拟财经法规无纸化考试答题的财经法规试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    403 => array(
        't' => '会计电算化考试试题',
        'k' => '会计电算化考试试题|会计电算化考试|初级会计电算化|会计电算化考试题型|会计电算化试题及答案|会计电算化试题|初级会计电算化考试试题|会计电算化实务题',
        'title' => '会计从业资格考试题库_初级会计电算化_会计电算化考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,会计电算化考试试题，会计从业在线模拟考试，会计电算化考试题型,会计电算化试题及答案,初级会计电算化考试试题,会计电算化实务题，会计电算化历年真题',
        'description' => '会计从业会计电算化考试题库是一个提供：会计电算化实务部分专项练习，会计电算化每日一练，会计电算化考试模拟试题，会计电算化考试历年真题，会计电算化模拟考试系统，会计电算化在线考试答题的会计电算化试题大全库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    412 => array(
        't' => '初级会计实务试题',
        'k' => '初级会计实务|初级会计实务试题|初级会计实务习题|初级会计实务试题及答案',
        'title' => '初级会计职称考试题库_初级会计实务_初级会计实务考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,初级会计实务，初级会计实务试题，初级会计实务习题，初级会计实务试题及答案，初级会计实务考试，初级会计实务考试历年真题，初级会计实务考前模拟题',
        'description' => '初级会计职称初级会计实务考试题库是一个提供：初级会计实务专项练习，初级会计实务每日一练，初级会计实务考试模拟试题，初级会计实务考试历年真题，模拟初级会计实务无纸化考试答题的初级会计实务试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    413 => array(
        't' => '经济法基础试题',
        'k' => '经济法基础|经济法基础试题|经济法试题|经济法案例分析题|经济法习题|经济法试题及答案',
        'title' => '初级会计职称考试题库_经济法基础_经济法基础考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,经济法基础，经济法基础试题，经济法试题，经济法基础考试历年真题，经济法基础模拟真题，经济法基础模拟题，经济法基础考前模拟题',
        'description' => '初级会计职称经济法基础考试题库是一个提供：经济法基础专项练习，经济法基础每日一练，经济法基础考试模拟试题，经济法基础考试历年真题，模拟经济法基础无纸化考试答题的经济法基础试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    414 => array(
        't' => '经济法试题',
        'k' => '中级经济法|经济法试题|经济法案例分析题|经济法习题|经济法试题及答案|经济法',
        'title' => '中级会计职称考试题库_经济法_经济法考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,中级经济法，经济法试题，经济法案例分析题，经济法试题及答案，经济法历年真题，经济法考前模拟真题，经济法模拟试题',
        'description' => '中级会计职称经济法考试题库是一个提供：经济法专项练习，经济法每日一练，经济法考试模拟试题，经济法考试历年真题，模拟经济法考试答题的经济法试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    415 => array(
        't' => '中级会计实务试题及答案',
        'k' => '中级会计实务|中级会计实务试题|中级会计实务试题及答案|中级会计实务练习题|中级会计实务历年真题',
        'title' => '中级会计职称考试题库_中级会计实务_中级会计实务考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,中级会计实务，中级会计实务试题，中级会计实务练习题，中级会计实务历年真题，中级会计实务模拟真题，中级会计实务模拟题，中级会计实务考前冲刺题',
        'description' => '中级会计职称中级会计实务考试题库是一个提供：中级会计实务专项练习，中级会计实务每日一练，中级会计实务考试模拟试题，中级会计实务考试历年真题，模拟中级会计实务考试答题的中级会计实务试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    416 => array(
        't' => '中级财务管理试题',
        'k' => '中级财务管理|中级财务管理试题|中级财务管理真题|中级财务管理习题|中级财务管理试题及答案',
        'title' => '中级会计职称考试题库_中级财务管理_中级财务管理考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,中级财务管理，中级财务管理试题，中级财务管理真题，中级财务管理历年真题，中级财务管理模拟试题，中级财务管理考前冲刺题',
        'description' => '中级会计职称中级财务管理考试题库是一个提供：中级财务管理专项练习，中级财务管理每日一练，中级财务管理考试模拟试题，中级财务管理考试历年真题，模拟中级财务管理考试答题的中级财务管理试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    420 => array(
        't' => '注册会计师会计考试试题',
        'k' => '注册会计师会计考试|会计考试试题|会计考试习题库|注册会计师会计模拟试题|注册会计师会计冲刺试题|注册会计师会计考试练习题|注册会计师会计考试模拟试题|注册会计师会计考试试题',
        'title' => '注册会计师考试题库_CPA考试题库_会计_会计考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,注册会计师考试，CPA考试题库,会计考试试题，注册会计师会计冲刺试题，注册会计师会计考试模拟试题，注册会计师会计考试历年真题，会计考试习题库',
        'description' => '注册会计师(CPA)会计考试题库是一个提供：注册会计师会计专项练习，注册会计师会计每日一练，注册会计师会计考试模拟试题，注册会计师会计考试历年真题，注册会计师会计无纸化考试答题的会计试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    421 => array(
        't' => '注册会计师审计考试试题',
        'k' => '注册会计师审计考试|注册会计师审计考试试题|审计试题|注册会计师审计模拟试题|注册会计师审计考试真题|注册会计师审计考试练习题|注册会计师审计试题|注册会计师审计历年真题|注册会计师审计考试模拟试题',
        'title' => '注册会计师考试题库_CPA考试题库_审计_审计考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,注册会计师审计考试，注册会计师审计考试试题，注册会计师审计考试真题，注册会计师审计考试历年真题，注册会计师审计考试模拟试题,CPA考试题库',
        'description' => '注册会计师(CPA)审计考试题库是一个提供：注册会计师审计专项练习，注册会计师审计每日一练，注册会计师审计考试模拟试题，注册会计师审计考试历年真题，注册会计师审计无纸化考试答题的审计试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    422 => array(
        't' => '注册会计师税法考试习题及答案',
        'k' => '注册会计师税法|税法试题|注册会计师税法历年真题|注册会计师税法练习题|注册会计师税法模拟试题|注册会计师税法考试习题及答案|注册会计师税法考试练习题|注册会计师税法考试真题|注册会计师税法考试试题',
        'title' => '注册会计师考试题库_CPA考试题库_税法_税法考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,注册会计师税法，注册会计师税法历年真题，注册会计师税法练习题，注册会计师税法考试习题及答案，注册会计师税法考试模拟试题，注册会计师税法考试试题,CPA考试题库',
        'description' => '注册会计师(CPA)税法考试题库是一个提供：注册会计师税法专项练习，注册会计师税法每日一练，注册会计师税法考试模拟试题，注册会计师税法考试历年真题，注册会计师税法无纸化考试答题的税法试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    423 => array(
        't' => '注册会计师经济法真题及答案',
        'k' => '注册会计师经济法考试|经济法试题|注册会计师经济法历年真题|注册会计师经济法模拟试题|经济法考试练习题|注册会计师经济法真题及答案|注册会计师经济法考试试题|注册会计师考试试题|注册会计师经济法考试练习题',
        'title' => '注册会计师考试题库_CPA考试题库_经济法_经济法考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,注册会计师经济法考试，注册会计师经济法历年真题，注册会计师经济法模拟试题，经济法考试练习题，注册会计师经济法真题及答案，注册会计师经济法考前冲刺题,CPA考试题库',
        'description' => '注册会计师(CPA)经济法考试题库是一个提供：注册会计师经济法专项练习，注册会计师经济法每日一练，注册会计师经济法考试模拟试题，注册会计师经济法考试历年真题，注册会计师经济法无纸化考试答题的经济法试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    424 => array(
        't' => '财务成本管理试题',
        'k' => '财务成本管理考试|财务成本管理试题|财务成本管理练习题|财务成本管理模拟试题|财务成本管理冲刺试题|注册会计师财务成本管理历年真题|注册会计师财务成本管理模拟试题',
        'title' => '注册会计师考试题库_CPA考试题库_财务管理成本_财务管理成本考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,财务成本管理考试，财务成本管理试题，财务成本管理模拟试题，财务成本管理冲刺试题，注册会计师财务成本管理历年真题，CPA财务成本管理模拟试题,CPA考试题库',
        'description' => '注册会计师(CPA)财务管理成本考试题库是一个提供：财务管理成本专项练习，财务管理成本每日一练，财务管理成本考试模拟试题，财务管理成本考试历年真题，财务管理成本无纸化考试答题的财务管理成本试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
    425 => array(
        't' => '战略与风险管理考试试题',
        'k' => '战略与风险管理考试|战略与风险管理考试试题|战略与风险管理真题|战略与风险管理预测试题|战略与风险管理考试习题|战略与风险管理考试历年真题|注册会计师战略与风险管理考试试题|注册会计师战略与风险管理模拟试题',
        'title' => '注册会计师考试题库_CPA考试题库_战略与风险管理_战略与风险管理考试题库_会计网题库_会计网',
        'keywords' => '会计网题库,战略与风险管理考试试题，战略与风险管理考试历年真题，战略与风险管理预测试题，CPA战略与风险管理考试试题，注册会计师战略与风险管理模拟试题,CPA考试题库',
        'description' => '注册会计师(CPA)战略与风险管理考试题库是一个提供：战略与风险管理专项练习，战略与风险管理每日一练，战略与风险管理考试模拟试题，战略与风险管理考试历年真题，战略与风险管理无纸化考试答题的战略与风险管理试题大全题库，会计网题库诚意为广大财考人员提供会计考试最新练习题及答案。',
    ),
);

$randquestion = array(
    'radio'=>array(
        'ids' => '101001,101004',
        'size' => 8,
    ),
    'checkbox'=>array(
        'ids' => '101002,101003',
        'size' => 7,
    )
);
$randquestion_300 = array(
    'radio'=>array(
        'ids' => '101001,101004',
        'size' => 50,
    ),
    'checkbox'=>array(
        'ids' => '101002,101003',
        'size' => 50,
    )
);

/**
 * 定时任务ID
 *
 */
$tasks = array('pageid'=>39, 'auto'=>array(140,139,138,137));
//$tasks = array('pageid'=>39, 'auto'=>array(144,143,142,141));
return array(
    'qtype'=>$array,
    'knowledge'=>$knowledge,
    'tasks'=>$tasks,
    'randquestion'=>$randquestion,
    'randquestion_300'=>$randquestion_300,
    'examtimes'=>$examtimes,
    't_k'=>$t_k,
	'url_cp'=>$url_cp
);





